In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import matplotlib.pyplot as plt
%matplotlib inline

In [2]:
imbd_name_basics = pd.read_csv('../Data/imdb.name.basics.csv')
imbd_title_akas = pd.read_csv('../Data/imdb.title.akas.csv')
imbd_title_basics = pd.read_csv('../Data/imdb.title.basics.csv')
imbd_title_crew = pd.read_csv('../Data/imdb.title.crew.csv')
imbd_title_principals = pd.read_csv('../Data/imdb.title.principals.csv')
imbd_title_ratings = pd.read_csv('../Data/imdb.title.ratings.csv')

In [3]:
#re-name column in title_akas
imbd_title_akas = imbd_title_akas.rename(columns={'title_id': 'tconst'})

In [4]:
#setting index columns
imbd_title_akas.set_index("tconst", inplace=True)

In [5]:
imbd_title_basics.set_index("tconst", inplace=True)

In [6]:
imbd_title_crew.set_index("tconst", inplace=True)

In [7]:
imbd_title_principals.set_index("tconst", inplace=True)

In [8]:
imbd_title_ratings.set_index("tconst", inplace=True)

In [9]:
#creating imbd dataframe
imbd_df = imbd_title_basics

In [11]:
#replacing empty genre cells with "Missing"
imbd_df['genres'].replace(np.nan, 'Missing', inplace=True, regex=True)

In [21]:
#joining imbd_title_ratings to imbd_df
imbd_df_join2 = imbd_df.join(imbd_title_ratings, how='left')

In [22]:
#joining imbd_title_crew to imbd_df
imbd_df_join3 = imbd_df_join2.join(imbd_title_crew, how='left')

In [19]:
imbd_title_crew.head()

                               directors              writers
tconst
tt0285252                      nm0899854            nm0899854
tt0438973                            NaN  nm0175726,nm1802864
tt0462036                      nm1940585            nm1940585
tt0835418                      nm0151540  nm0310087,nm0841532
tt0878654  nm0089502,nm2291498,nm2292011            nm0284943

In [25]:
#cleaning imbd_title_akas before merge to imbd_df
imbd_title_akas_cleaned = imbd_title_akas.loc[imbd_title_akas.is_original_title == 1].copy()

In [28]:
#add regions column
imbd_title_akas_cleaned['regions'] = imbd_title_akas_cleaned['region']

In [43]:
imbd_title_akas_cleaned.regions = imbd_title_akas.apply(lambda x: list(imbd_title_akas.loc[imbd_title_akas.index == x, 'region']))

In [45]:
#adding list of regions to each original title
region_list_dict = {}
for title in imbd_title_akas_cleaned.index:
    region_list = list(imbd_title_akas.loc[imbd_title_akas.index == title, 'region'])
    region_list_dict.update(title = region_list)
#     imbd_title_akas_cleaned.at[title, 'regions'] = region_list
region_list_df = pd.DataFrame(region_list_dict)
region_list_df.head()

  title
0   NaN
1    ES
2   XWW

In [ ]:
#joining imbd_title_crew to imbd_df
imbd_df_join4 = imbd_df_join3.join(????, how='left')

In [35]:
imbd_title_akas.head()

,ordering,title,region,language,types,attributes,is_original_title
tconst,,,,,,,
tt0369610,10,Джурасик свят,BG,bg,NaN,NaN,0.0
tt0369610,11,Jurashikku warudo,JP,NaN,imdbDisplay,NaN,0.0
tt0369610,12,Jurassic World: O Mundo dos Dinossauros,BR,NaN,imdbDisplay,NaN,0.0
tt0369610,13,O Mundo dos Dinossauros,BR,NaN,NaN,short title,0.0
tt0369610,14,Jurassic World,FR,NaN,imdbDisplay,NaN,0.0

In [44]:
imbd_title_akas_cleaned.head()

,ordering,title,region,language,types,attributes,is_original_title,regions
tconst,,,,,,,,
tt0369610,45,Jurassic World,NaN,NaN,original,NaN,1.0,NaN
tt0401729,7,John Carter,NaN,NaN,original,NaN,1.0,NaN
tt10010134,1,Versailles Rediscovered - The Sun King's Vanis...,NaN,NaN,original,NaN,1.0,NaN
tt10027708,1,Miguelito - Canto a Borinquen,NaN,NaN,original,NaN,1.0,NaN
tt10050722,1,Thing I Don't Get,NaN,NaN,original,NaN,1.0,NaN

In [46]:
imbd_df_join3.head()

,primary_title,original_title,start_year,runtime_minutes,genres,averagerating,numvotes,directors,writers
tconst,,,,,,,,,
tt0063540,Sunghursh,Sunghursh,2013,175.0,"Action,Crime,Drama",7.0,77.0,nm0712540,"nm0023551,nm1194313,nm0347899,nm1391276"
tt0066787,One Day Before the Rainy Season,Ashad Ka Ek Din,2019,114.0,"Biography,Drama",7.2,43.0,nm0002411,NaN
tt0069049,The Other Side of the Wind,The Other Side of the Wind,2018,122.0,Drama,6.9,4517.0,nm0000080,"nm0000080,nm0462648"
tt0069204,Sabse Bada Sukh,Sabse Bada Sukh,2018,NaN,"Comedy,Drama",6.1,13.0,nm0611531,nm0347899
tt0100275,The Wandering Soap Opera,La Telenovela Errante,2017,80.0,"Comedy,Drama,Fantasy",6.5,119.0,"nm0765384,nm0749914","nm1360635,nm0749914"

In [47]:
imbd_df_join3.to_csv("imdb")

AttributeError: module 'pandas' has no attribute 'to_csv'